{
  "introduction": "The Grove Ecosystem is a set of command-line tools for AI-assisted coding, designed primarily for development within a monorepo. It provides orchestration layers and developer utilities to make large language models (LLMs) more effective for coding.\n\nThe central goal behind Grove is: How can software development with AI agents be a more rational, predictable, and effective process?\n\nThe answer provided by Grove is a local-first, editor-independent system built on two foundations: plain text and specialized CLI tools. Plain text, primarily Markdown, serves as a flexible and portable medium for planning, logging, and orchestrating work. A suite of small CLI tools provides the mechanisms to manage code, context, and workflows.\n\nThis approach keeps the developer in control, avoids editor lock-in, and promotes a modular, extensible ecosystem.\n\n## Core Assumptions \u0026 Workflow\n\nGrove is built on several key assumptions about developing software with AI:\n\n1.  **Use the Right LLM Tool for the Job**: Different models and tools excel at different tasks. A typical Grove workflow involves using a model like Google's Gemini API for high-level planning and analysis across large codebases, then feeding those plans to a model like Anthropic's Claude Code for implementation. This \"Plan -\u003e Agent -\u003e Review -\u003e Agent\" cycle yields more consistent and successful outcomes.\n\n2.  **Monorepos and Workspaces are Effective**: LLMs perform better on smaller, more focused codebases. By organizing projects in a monorepo, dependencies can be managed effectively while allowing agents to operate on individual, self-contained workspaces. This structure is managed by a suite of `grove` commands for viewing status, managing dependencies, and orchestrating releases across the entire ecosystem.\n\n3.  **Parallel Development in Isolated Environments is Key**: Working on multiple features in parallel across different projects or branches is an effective way to manage complexity. The main drawback to this approach is the cognitive overhead of context-switching. Grove mitigates this by embracing Git worktrees as a primary development construct, with tools to create, manage, clean up, and quickly switch between these isolated environments.\n\n4.  **Plain Text is the Best Interface**: Markdown is used as the primary medium for planning, agent instructions, and logging. It is portable, versionable, and can be consumed by both humans and LLMs. This creates a durable, high-level record of development activity that lives longer than ephemeral context of a single chat session."
}